[
  {
    "title": "Supplication Before Sleeping (In Your Name O Allah I die and I live)",
    "arabic": "بِاسْمِكَ اللَّهُمَّ أَمُوْتُ وَأَحْيَا",
    "latin": "bismika allahumma amuutu wa ahyaa",
    "translation": "In Your name, O Allah, I die and I live.",
    "notes": "Short supplication to say when lying down to sleep.",
    "fawaid": "A brief formula attributing life and death to Allah when going to sleep; part of the general Sunnah of remembering Allah before sleep.",
    "source": "Reported in hadith collections and adhkar manuals; classical adhkar compilations."
  },
  {
    "title": "Ayat al-Kursi",
    "arabic": "ٱللَّهُ لَآ إِلَٰهَ إِلَّا هُوَ ٱلْحَىُّ ٱلْقَيُّومُ ۚ لَا تَأْخُذُهُۥ سِنَةٌ وَلَا نَوْمٌ ۚ لَّهُۥ مَا فِى ٱلسَّمَٰوَٰتِ وَمَا فِى ٱلْأَرْضِ ۗ مَن ذَا ٱلَّذِى يَشْفَعُ عِندَهُۥٓ إِلَّا بِإِذْنِهِۦ ۚ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ ۖ وَلَا يُحِيطُونَ بِشَىْءٍ مِّنْ عِلْمِهِۦٓ إِلَّا بِمَا شَآءَ ۚ وَسِعَ كُرْسِيُّهُ ٱلسَّمَٰوَٰتِ وَٱلْأَرْضَ ۖ وَلَا يَـُٔودُهُۥ حِفْظُهُمَا ۚ وَهُوَ ٱلْعَلِىُّ ٱلْعَظِيمُ",
    "latin": "Allāhu lā ilāha illā huw, al-ḥayyul-qayyụm, lā ta`khużuhụ sinatuw wa lā na`ụm, lahụ mā fis-samāwāti wa mā fil-arḍ, man żallażī yasyfa'u 'indahū illā bi`iżnih, ya'lamu mā baina aidīhim wa mā khalfahum, wa lā yuḥīṭụna bisyai`im min 'ilmihī illā bimā syā`, wasi'a kursiyyuhus-samāwāti wal-arḍ, wa lā ya`ụduhụ ḥifẓuhumā, wa huwal-'aliyyul-'aẓīm",
    "translation": "Allah - there is no deity except Him, the Ever-Living, the Sustainer of [all] existence. Neither drowsiness overtakes Him nor sleep. To Him belongs whatever is in the heavens and whatever is on the earth. Who is it that can intercede with Him except by His permission? He knows what is [presently] before them and what will be after them, and they encompass not a thing of His knowledge except for what He wills. His Kursi extends over the heavens and the earth, and their preservation tires Him not. And He is the Most High, the Most Great.",
    "notes": "Read 1x",
    "benefits": "Whoever recites this verse in the morning will be protected until the evening. And whoever recites it in the evening will be protected until the morning.",
    "source": "HR. at-Tirmidzi: 2879"
  },
  {
    "title": "Short Seeking Forgiveness Before Sleep",
    "arabic": "أَسْتَغْفِرُ اللَّهَ",
    "latin": "astaghfirullah",
    "translation": "I seek forgiveness from Allah.",
    "notes": "Recite freely before sleeping.",
    "fawaid": "Seeking forgiveness before sleep is part of the Prophet's practice of evening remembrance; it purifies the heart and is recommended to end the day with repentance.",
    "source": "General practice transmitted in hadith collections and adhkar compilations."
  },
  {
    "title": "Dua for Security and Well-being (complete form)",
    "arabic": "اللَّهُمَّ أَنْتَ السَّلَامُ، وَمِنْكَ السَّلَامُ، تَبَارَكْتَ يَا ذَا الْجَلَالِ وَالْإِكْرَامِ",
    "latin": "allahumma anta as-salaamu wa minka as-salaam, tabaarakta ya dhal-jalaali wal-ikram",
    "translation": "O Allah, You are Peace and from You is peace. Blessed are You, O Possessor of majesty and honour.",
    "notes": "A short dhikr frequently said at the end of prayer and in evening remembrances.",
    "fawaid": "Affirms that peace comes from Allah and acknowledges His majesty; used for seeking serenity and protection.",
    "source": "Hadith - reported as recited frequently by the Prophet after prayer (e.g., hadith in Muslim)."
  }
]
