[
  {
    "title": "Dua of Yunus (When Distressed)",
    "arabic": "لَا إِلَهَ إِلَّا أَنْتَ سُبْحَانَكَ إِنِّي كُنتُ مِنَ الظَّالِمِينَ",
    "latin": "laa ilaaha illa anta subhaanaka innii kuntu minas-zhaalimiina",
    "translation": "There is no deity except You; exalted are You. Indeed I have been of the wrongdoers.",
    "notes": "Recite when in severe distress or hardship.",
    "fawaid": "This is the supplication of Prophet Yunus (Jonah) in the belly of the whale. It is taught in the Qur'an and is a powerful du'a for relief from distress and sins.",
    "source": "QS. Al-Anbiya (21:87). Widely transmitted in Qur'an and classical tafsir."
  },
  {
    "title": "Rabbana - Good in this World and the Hereafter",
    "arabic": "رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الْآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ",
    "latin": "rabbana atina fid-dunya hasanatan wa fil-akhirati hasanatan wa qinaa 'adhaaban-naar",
    "translation": "Our Lord, grant us good in this world and good in the Hereafter and save us from the punishment of the Fire.",
    "notes": "Qur'anic du'a suitable for general supplication after any du'a.",
    "fawaid": "Comprehensive du'a asking for benefit in both worlds and protection from Hellfire; frequently taught to be recited after du'a and in daily supplication.",
    "source": "QS. Al-Baqarah (2:201)."
  },
  {
    "title": "Sayyid al-Istighfar (The Chief Supplication for Forgiveness)",
    "arabic": "اللَّهُمَّ أَنْتَ رَبِّي لَا إِلَهَ إِلَّا أَنْتَ خَلَقْتَنِي وَأَنَا عَبْدُكَ وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ وَأَبُوءُ بِذَنْبِي فَاغْفِرْ لِي فَإِنَّهُ لَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ",
    "latin": "allahumma anta rabbi la ilaha illa anta khalaqtani wa ana 'abduka wa ana 'ala 'ahdika wa wa'dika ma ista'tu a'udhu bika min sharri ma sana'tu abuu'u laka bini'matika 'alayya wa abuu'u bidhanbi faghfir li fa innahu la yaghfiru adh-dhunuba illa anta",
    "translation": "O Allah, You are my Lord; there is no deity except You. You created me and I am Your servant, and I uphold Your covenant and promise as much as I can. I seek refuge in You from the evil of what I have done. I acknowledge Your favor upon me and I acknowledge my sin; so forgive me, for none can forgive sins except You.",
    "notes": "Recite with sincerity; known from the Prophet's teaching.",
    "fawaid": "The Prophet (peace be upon him) said that whoever recites this with conviction in the morning then dies before evening will enter Paradise, and likewise if recited at night then dies before morning. It is the foremost formula of seeking forgiveness.",
    "source": "Hadith - Sahih al-Bukhari (text reported in Bukhari and other sahih collections)."
  },
  {
    "title": "Rabbana (Forgiveness for Self, Parents and Believers)",
    "arabic": "رَبِّ اغْفِرْ لِي وَلِوَالِدَيَّ وَلِلْمُؤْمِنِينَ يَوْمَ يَقُومُ الْحِسَابُ",
    "latin": "rabbi ighfir lii wa liwaalidayya wa lilmu'miniina yawma yaqoomul-hisaab",
    "translation": "My Lord, forgive me, my parents and the believers on the Day when the account is established.",
    "notes": "Qur'anic supplication taught by Prophet Ibrahim (peace be upon him) in the Qur'an.",
    "fawaid": "A righteous foundational du'a taught by Prophet Ibrahim (peace be upon him) - excellent to recite for parents and the wider believing community.",
    "source": "QS. Ibrahim (14:41)."
  },
  {
    "title": "Dua for Beneficial Knowledge, Good Provision, and Accepted Deeds",
    "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْمًا نَافِعًا وَرِزْقًا طَيِّبًا وَعَمَلاً مُتَقَبَّلاً",
    "latin": "allahumma innii as'aluka 'ilman naafi'an wa rizqan tayyiban wa 'amalan mutaqabbalan",
    "translation": "O Allah, I ask You for beneficial knowledge, good (lawful) provision, and deeds that are accepted.",
    "notes": "Recommended after the Fajr prayer, and generally in morning supplications.",
    "fawaid": "A brief du'a that asks for the three goods every believer seeks: useful knowledge, lawful provision and deeds that are accepted by Allah.",
    "source": "Hadith - reported in Ibn Majah and Ahmad; authenticated in classical adkar compilations and hadith collections (see Ibn Majah, Ahmad)."
  }
]
