[
  {
    "title": "Refuge from Worry, Grief, Laziness, Miserliness, Cowardice, Debt and Men",
    "arabic": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْهَمِّ وَالْحُزْنِ وَالْعَجْزِ وَالْكَسَلِ وَالْجُبْنِ وَالْبُخْلِ وَضَلَعِ الدَّيْنِ وَغَلَبَةِ الرِّجَالِ. رَبَّنَا عَلَيْكَ تَوَكَّلْنَا وَإِلَيْكَ أَنَبْنَا وَإِلَيْكَ الْمَصِيرُ",
    "latin": "Allahumma inni a'udhu bika minal-hammi wal-hazani, wal-'ajzi wal-kasali, wal-jubni wal-bukhli, wa dala'id-daini wa ghalabatir-rijal. Rabbana 'alayka tawakkalna wa ilayka anabna wa ilayka al-masir.",
    "translation": "O Allah, I seek refuge in You from worry and grief, from incapacity and laziness, from cowardice and miserliness, from the burden of debt and from being overpowered by others. Our Lord, upon You we place our trust; to You we turn in repentance; and to You is the final return.",
    "notes": "A classical du'a used when leaving the house or when asking for protection from personal and social harms. Recite when setting out or whenever you feel burdened.",
    "fawaid": "This supplication seeks refuge from internal and external harms (emotional burdens, weakness, financial difficulty and oppression). It combines refuge-seeking with tawakkul and turning back to Allah - an established prophetic pattern.",
    "source": "Reported in hadith collections including Abu Dawud, at-Tirmidhi, Ibn Majah and an-Nasa'i in related chains of adhkar. (Found in classical adhkar corpora - widely transmitted in the Sunnah literature.)"
  },
  {
    "title": "Tahlil & Tasbih (Daily 100× Set)",
    "arabic": "سُبْحَانَ اللَّهِ. الْحَمْدُ لِلَّهِ. لَا إِلَهَ إِلَّا اللَّهُ. اللَّهُ أَكْبَرُ وَتَبَارَكَ اللَّهُ",
    "latin": "SubhanAllah. Alhamdulillah. La ilaha illa Allah. Allahu Akbar. wa TabarakAllah.",
    "translation": "Glory be to Allah. All praise is for Allah. There is no deity except Allah. Allah is the Greatest. Blessed is Allah.",
    "notes": "Recite combined as adhkar; many people recite the short phrases repeatedly (commonly in sets to reach 100 daily).",
    "fawaid": "Collective dhikr of glorification and praise; reciting these frequently is emphasized in many hadiths and adhkar compilations and is associated with forgiveness, reward and constant remembrance of Allah.",
    "source": "Virtues and counts of tasbih/tahmid/takbir found in hadith literature and adhkar compilations (see Sahih hadith on post-prayer dhikr and virtues)."
  },
  {
    "title": "Istighfar (Seek Forgiveness 100×)",
    "arabic": "أَسْتَغْفِرُ اللَّهَ وَأَتُوبُ إِلَيْهِ",
    "latin": "astaghfirullah wa atubu ilayhi",
    "translation": "I seek Allah's forgiveness and I repent to Him.",
    "notes": "Recite one hundred times daily as a recommended practice (many companions and the Prophet practiced frequent seeking of forgiveness).",
    "fawaid": "The Prophet (peace be upon him) used to seek forgiveness often; Ibn 'Umar narrates the Prophet repented frequently (100× a day is a transmitted practice). Frequent istighfar cleanses the heart and brings acceptance.",
    "source": "Hadith - Narrations in Sahih collections and classical reports on the Prophet's frequent istighfar (e.g., Bukhari, Muslim reports on frequent repentance)."
  },
  {
    "title": "Hasbiyallahu (Saying of Reliance) - recite 7× after Fajr/Maghrib",
    "arabic": "حَسْبِيَ اللَّهُ لَا إِلَـٰهَ إِلَّا هُوَ ۖ عَلَيْهِ تَوَكَّلْتُ ۖ وَهُوَ رَبُّ الْعَرْشِ الْعَظِيمِ",
    "latin": "Hasbiyallahu la ilaha illa huwa, 'alayhi tawakkaltu, wa huwa rabbul-'arshil-'azim",
    "translation": "Allah is sufficient for me. There is no deity except Him. Upon Him I rely, and He is the Lord of the Great Throne.",
    "notes": "Traditionally recited for reassurance; the user asked for 7× after Fajr and 7× after Maghrib - a well-known practice in many adhkar lists.",
    "fawaid": "A strong Qur'anic phrase used for tawakkul; recitation brings reliance upon Allah and solace. It is rooted in the Qur'anic usage and employed in hadith/adhkar practice.",
    "source": "Qur'an - found in the Qur'anic phrasing and used widely as dhikr (Qur'anic phrase cited in many adhkar references)."
  },
  {
    "title": "Three-times Protection - Bismillahi (recite 3× after Fajr and Maghrib)",
    "arabic": "بِسْمِ اللَّهِ الَّذِي لَا يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الْأَرْضِ وَلَا فِي السَّمَاءِ وَهُوَ السَّمِيعُ الْعَلِيمُ",
    "latin": "Bismillahi alladhi la yadurru ma'a ismihi shay'un fil-ardi wa la fi as-sama'i wa huwa as-sami'u al-'alim",
    "translation": "In the name of Allah, with Whose Name nothing in the earth nor in the heavens can cause harm, and He is the All-Hearing, All-Knowing.",
    "notes": "Recite three times after Fajr and three times after Maghrib (classical recommendation).",
    "fawaid": "Reported as a short protection supplication; practicing it three times in morning and evening is classically recommended to seek protection from harm.",
    "source": "Hadith and adhkar collections (reported in collections of morning/evening adhkar such as Hisn al-Muslim and classical hadith references)."
  },
  {
    "title": "Invocation asking by the Oneness of Allah (Form of affirmation)",
    "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ بِأَنِّي أَشْهَدُ أَنَّكَ أَنْتَ اللَّهُ لَا إِلَهَ إِلَّا أَنْتَ، الأَحَدُ، الصَّمَدُ، الَّذِي لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُن لَهُ كُفُوًا أَحَدٌ",
    "latin": "Allahumma inni as'aluka bi anni ash-hadu annaka anta Allah, la ilaha illa anta, Al-Ahad, As-Samad, alladhi lam yalid wa lam yulad, wa lam yakun lahu kufuwan ahad",
    "translation": "O Allah, I ask You by my testimony that You are Allah, there is no deity except You - the One, the Self-Sufficient, Who did not beget and was not begotten and there is none comparable to Him.",
    "notes": "This formulation invokes the affirmation of Tawhid (Oneness) when asking Allah for need; it is a devotional supplication using Qur'anic descriptions of Allah.",
    "fawaid": "Invoking Allah's attributes and the testimony of Oneness strengthens the supplication; using the names and attributes of Allah in du'a is an established sunnah method.",
    "source": "This formulation is present in classical adhkar compilations and is based on Qur'anic attributes (Surah Al-Ikhlas) and the practice of seeking by invoking Allah's names (found in adkar manuals)."
  },
  {
    "title": "Dua of Aishah: 'You are Pardoning, You love to pardon - Pardon me'",
    "arabic": "اللَّهُمَّ إِنَّكَ عَفُوٌّ تُحِبُّ الْعَفْوَ فَاعْفُ عَنِّي",
    "latin": "Allahumma innaka 'afuwwun tuhibbu al-'afwa fa'fu 'anni",
    "translation": "O Allah, You are Pardoning and You love to pardon, so pardon me.",
    "notes": "The Prophet (peace be upon him) taught this to Aisha (may Allah be pleased with her) as the recommended du'a for Laylat al-Qadr (Night of Decree).",
    "fawaid": "A short but deep supplication: asking Allah's pardon with the attribute that He loves to pardon. Recommended especially in the last nights of Ramadan and on Laylat al-Qadr.",
    "source": "Hadith - narrated in collections of the Prophet's guidance to Aisha about the dua to say on Laylat al-Qadr (reported in Tirmidhi and other classical collections)."
  },
  {
    "title": "Supplication: Conceal My Faults and Protect Me from Fears",
    "arabic": "اللَّهُمَّ اسْتُرْ عَوْرَاتِي وَآمِنْ رَوْعَاتِي",
    "latin": "Allahumma astur 'awraati wa amin raw'aatii",
    "translation": "O Allah, conceal my faults and protect me from my fears.",
    "notes": "Short plea for privacy and safety; commonly included in morning and evening adhkar lists.",
    "fawaid": "Seeks Allah's covering of one's shortcomings and protection from things that terrify or harm a person. Included in classical adkar sources as part of general supplications for protection and dignity.",
    "source": "Found in classical adhkar compendia (e.g., Hisn al-Muslim) and transmitted in collections of morning/evening adhkar."
  },
  {
    "title": "Rabbana - Trust and Return",
    "arabic": "رَبَّنَا عَلَيْكَ تَوَكَّلْنَا وَإِلَيْكَ أَنَبْنَا وَإِلَيْكَ الْمَصِيرُ",
    "latin": "Rabbana 'alayka tawakkalna wa ilayka anabna wa ilayka al-masir",
    "translation": "Our Lord, upon You we place our trust, to You we have turned in repentance, and to You is the final return.",
    "notes": "Often recited as a summary of tawakkul (trust), repentance and final return to Allah.",
    "fawaid": "A compact expression of three core convictions: reliance on Allah, turning back to Him, and awareness of the final return - teaches reliance and humility.",
    "source": "Appears in classical adhkar lists and is integrated from prophetic supplications and Qur'anic/tasbih themes."
  },
  {
    "title": "O Allah, Make My Heart Firm on Your Religion",
    "arabic": "اللَّهُمَّ ثَبِّتْ قَلْبِي عَلَى دِينِكَ",
    "latin": "Allahumma thabbit qalbi 'ala dinika",
    "translation": "O Allah, make my heart firm upon Your religion.",
    "notes": "Short, strong plea for steadfastness in faith.",
    "fawaid": "A short supplication asking for inner firmness and guidance; aligns with many prophetic du'as asking Allah to make the heart steadfast.",
    "source": "This form is a condensed version of various du'as in hadith literature asking Allah to make the heart firm on guidance (found across adhkar manuals)."
  },
  {
    "title": "Rabbana - Do Not Let Our Hearts Deviate and Grant Mercy (Qur'anic Du'a)",
    "arabic": "رَبَّنَا لَا تُزِغْ قُلُوبَنَا بَعْدَ إِذْ هَدَيْتَنَا وَهَبْ لَنَا مِنْ لَدُنْكَ رَحْمَةً ۚ إِنَّكَ أَنْتَ الْوَهَّابُ",
    "latin": "Rabbana la tuzigh qulubana ba'da idh hadaytana wa hab lana min ladunka rahmah innaka anta al-Wahhab",
    "translation": "Our Lord, do not let our hearts deviate after You have guided us and grant us mercy from Yourself. Indeed, You are the Bestower.",
    "notes": "A Qur'anic du'a appropriate to read frequently for protection against spiritual deviation.",
    "fawaid": "A direct Qur'anic supplication asking Allah to keep hearts firm after guidance and to grant mercy, showing the link between guidance and the need for continual divine support.",
    "source": "QS. Aal 'Imran (3:8)."
  },
  {
    "title": "Bismillahi ... - Protection formula (3× recommendation)",
    "arabic": "بِسْمِ اللهِ الَّذِي لَا يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الْأَرْضِ وَلَا فِي السَّمَاءِ وَهُوَ السَّمِيعُ الْعَلِيمُ",
    "latin": "Bismillahi alladhi la yadurru ma'a ismihi shay'un fil-ardi wa la fi as-sama'i wa huwa as-sami'u al-'alim",
    "translation": "In the name of Allah; with whose Name nothing in the earth or the heavens can cause harm; and He is the All-Hearing, All-Knowing.",
    "notes": "As requested, recite 3× after Fajr and 3× after Maghrib as part of morning/evening adhkar.",
    "fawaid": "Short protective formula included in morning/evening adhkar; commonly transmitted in adkar manuals (recommended 3× for protection in some compilations).",
    "source": "Hadith and adhkar compilations (e.g., included in Hisn al-Muslim and other morning/evening lists)."
  },
  {
    "title": "O Allah, Remove Debt from Me and Make Me Free of Poverty",
    "arabic": "اللَّهُمَّ أَدِّ عَنِّي الدَّيْنَ، وَأَغْنِنِي مِنَ الفَقْرِ",
    "latin": "Allahumma addi 'anni ad-dayna wa aghnini mina al-faqr",
    "translation": "O Allah, take away my debt and enrich me from poverty.",
    "notes": "Use when facing financial hardship. Short and direct.",
    "fawaid": "A sincere plea for economic relief and sufficiency; reciting it regularly is part of prophetic guidance on asking Allah for material and spiritual ease.",
    "source": "Found in classical adhkar compilations and taught among supplications in hadith-based collections."
  },
  {
    "title": "Dua for Forgiveness for Brothers in Faith",
    "arabic": "اللَّهُمَّ اغْفِرْ لَنَا وَلِإِخْوَانِنَا الَّذِينَ سَبَقُونَا بِالْإِيمَانِ",
    "latin": "Allahumma ighfir lana wa li-ikhwanina alladhina sabaquna bil-iman",
    "translation": "O Allah, forgive us and our brothers who preceded us in faith.",
    "notes": "A communal du'a asking forgiveness for earlier believers.",
    "fawaid": "Asking for forgiveness for fellow believers is a pious, communal practice which increases compassion and connection among the community.",
    "source": "Commonly found in du'a collections and communal supplication lists; parallel Qur'anic/hadith themes of seeking forgiveness for Muslims."
  },
  {
    "title": "O Allah, I Hope for Your Mercy - Do Not Leave Me to Myself",
    "arabic": "اللَّهُمَّ رَحْمَتَكَ أَرْجُو فَلاَ تَكِلْنِي إِلَى نَفْسِي طَرْفَةَ عَيْنٍ وَأَصْلِحْ لِي شَأْنِي كُلَّهُ لاَ إِلَهَ إِلاَّ أَنْتَ",
    "latin": "Allahumma rahmataka arju fala takilni ila nafsi tarfata 'aynin wa aslih li sha'ni kullahu la ilaha illa anta",
    "translation": "O Allah, I hope for Your mercy; do not leave me to myself for the blink of an eye and rectify for me all of my affairs. There is no deity worthy of worship except You.",
    "notes": "Powerful comprehensive du'a for mercy, reliance and affairs' rectification.",
    "fawaid": "A plea for mercy and continuous divine care, asking not to be left even for a moment to one's own devices, reflecting deep dependence on Allah.",
    "source": "Narrated in hadith collections / adhkar lists (commonly transmitted as part of morning/evening adhkar and prophetic supplications)."
  },
  {
    "title": "Dua for Forgiveness for Family and Guests",
    "arabic": "رَبِّ اغْفِرْ لِي وَلِوَالِدَيَّ وَلِمَنْ دَخَلَ بَيْتِيَ مُؤْمِنًا وَلِلْمُؤْمِنِينَ وَالْمُؤْمِنَاتِ",
    "latin": "Rabbi ighfir li wa liwalidayya wa liman dakhala bayti mu'minan wa lil-mu'minina wal-mu'minat",
    "translation": "My Lord, forgive me and my parents and whoever enters my house as a believer and the believing men and the believing women.",
    "notes": "Supplication for household and visitors.",
    "fawaid": "A heartfelt request for forgiveness covering the household and all believers; useful to recite when thinking of family and community.",
    "source": "Formulations of communal forgiveness appear across Qur'anic supplications and hadith; commonly found in many du'a compendia."
  }
]
