[
  {
    "title": "Istighfar",
    "arabic": "أَسْتَغْفِرُ اللَّهَ",
    "latin": "astagh-firullah",
    "translation": "I seek forgiveness from Allah.",
    "notes": "Read 3x",
    "benefits": "When the Messenger of Allah, peace and blessings be upon him, finished his prayer, he would seek forgiveness three times and recite the dhikr above. Al-Auza'i stated that the recitation of istighfar is 'Astaghfirullah, Astaghfirullah.'",
    "source": "HR. Muslim No. 591"
  },
  {
    "title": "Allah, The Giver of Peace",
    "arabic": "اَللَّهُمَّ أَنْتَ السَّلاَمُ، وَمِنْكَ السَّلاَمُ، تَبَارَكْتَ يَا ذَا الْجَلاَلِ وَاْلإِكْرَامِ",
    "latin": "allahumma antas salaam wa minkas salaam tabaarokta ya dzal jalaali wal ikrom",
    "translation": "O Allah, You are Peace, and from You is peace. Blessed are You, O Possessor of majesty and honor.",
    "notes": "Read 1x",
    "benefits": "When the Messenger of Allah, peace and blessings be upon him, finished his prayer, he would seek forgiveness three times and recite the dhikr above. Al-Auza'i stated that the recitation of istighfar is 'Astaghfirullah, Astaghfirullah.'",
    "source": "HR. Muslim No. 591"
  },
  {
    "title": "Allah, The Preventer and The Giver of All Things",
    "arabic": "لاَ إِلَـهَ إِلاَّ اللهُ وَحْدَهُ لاَ شَرِيْكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيْرُ، اَللَّهُمَّ لاَ مَانِعَ لِمَا أَعْطَيْتَ، وَلاَ مُعْطِيَ لِمَا مَنَعْتَ، وَلاَ يَنْفَعُ ذَا الْجَدِّ مِنْكَ الْجَدُّ",
    "latin": "laa ilaha illallah wahdahu laa syarika lah, lahul mulku wa lahul hamdu wa huwa 'ala kulli syai-in qodiir. allahumma laa maani'a lima a'thoita wa laa mu'thiya limaa mana'ta wa laa yanfau dzal jaddi minkal jaddu",
    "translation": "There is no deity worthy of worship except Allah alone, He has no partner. To Him belongs dominion and praise, and He is over all things competent. O Allah, there is no preventer of what You give, and no giver of what You withhold, and wealth and honor do not benefit their possessor (except faith and righteous deeds that save from punishment). Only from You is wealth and honor.",
    "notes": "Read 1x",
    "benefits": null,
    "source": "HR. Bukhari No. 844 and Muslim No. 593"
  },
  {
    "title": "Allah, The Possessor of All and The Only One Worthy of Worship",
    "arabic": "لاَ إِلَـهَ إِلاَّ اللهُ وَحْدَهُ لاَ شَرِيْكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيْرُ. لاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللهِ، لاَ إِلَـهَ إِلاَّ اللهُ، وَلاَ نَعْبُدُ إِلاَّ إِيَّاهُ، لَهُ النِّعْمَةُ وَلَهُ الْفَضْلُ وَلَهُ الثَّنَاءُ الْحَسَنُ، لاَ إِلَـهَ إِلاَّ اللهُ مُخْلِصِيْنَ لَهُ الدِّيْنَ وَلَوْ كَرِهَ الْكَافِرُوْنَ",
    "latin": "laa ilaha illallah wahdahu laa syarika lah. lahul mulku wa lahul hamdu wa huwa 'ala kulli syai-in qodiir. laa hawla wa laa quwwata illa billah. laa ilaha illallah wa laa na'budu illa iyyah. lahun ni'mah wa lahul fadhl wa lahuts tsanaaul hasan. laa ilaha illallah mukhlishiina lahud diin wa law karihal kaafiruun",
    "translation": "There is no deity worthy of worship except Allah alone, He has no partner. To Him belongs dominion and praise, and He is over all things competent. There is no power and no strength except by Allah. There is no deity worthy of worship except Allah, and we do not worship except Him. To Him belongs all favor, grace, and good praise. There is no deity worthy of worship except Allah, making our religion sincerely for Him, even if the disbelievers dislike it.",
    "notes": "Read 1x",
    "benefits": "'Abdullah bin Zubair said, \"The Prophet, peace and blessings be upon him, used to recite the tahlil (laa ilaha illallah) at the end of the prayer.\"",
    "source": "HR. Muslim No. 594"
  },
  {
    "title": "Tasbih",
    "arabic": "سُبْحَانَ اللهِ",
    "latin": "subhanallah",
    "translation": "Glory be to Allah",
    "notes": "Read 33x",
    "benefits": null,
    "source": null
  },
  {
    "title": "Tahmid",
    "arabic": "الْحَمْدُ لِلَّهِ",
    "latin": "alhamdulillah",
    "translation": "All praise is for Allah",
    "notes": "Read 33x",
    "benefits": null,
    "source": null
  },
  {
    "title": "Takbir",
    "arabic": "اللهُ أَكْبَرُ",
    "latin": "allahu akbar",
    "translation": "Allah is the Greatest",
    "notes": "Read 33x",
    "benefits": null,
    "source": null
  },
  {
    "title": "There is No Partner for Allah, and To Him Belongs All Things",
    "arabic": "لاَ إِلَـهَ إِلاَّ اللهُ وَحْدَهُ لاَ شَرِيْكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيْرُ",
    "latin": "laa ilaha illallah wahda, laa syarika lah. lahul mulku wa lahul hamdu wa huwa 'ala kulli syai-in qodiir",
    "translation": "There is no deity worthy of worship except Allah alone, He has no partner. To Him belongs dominion and praise, and He is over all things competent.",
    "notes": "Read 1x",
    "benefits": "Whoever recites the dhikr above, his sins will be forgiven, even if they are as numerous as the foam on the ocean. Imam Nawawi, may Allah have mercy on him, said that the text of the hadith indicates that 'Subhanallah', 'Alhamdulillah', and 'Allahu akbar' are each recited 33 times separately.",
    "source": "Syarh Shahih Muslim, 5: 84"
  },
  {
    "title": "Ayat al-Kursi",
    "arabic": "ٱللَّهُ لَآ إِلَٰهَ إِلَّا هُوَ ٱلْحَىُّ ٱلْقَيُّومُ ۚ لَا تَأْخُذُهُۥ سِنَةٌ وَلَا نَوْمٌ ۚ لَّهُۥ مَا فِى ٱلسَّمَٰوَٰتِ وَمَا فِى ٱلْأَرْضِ ۗ مَن ذَا ٱلَّذِى يَشْفَعُ عِندَهُۥٓ إِلَّا بِإِذْنِهِۦ ۚ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ ۖ وَلَا يُحِيطُونَ بِشَىْءٍ مِّنْ عِلْمِهِۦٓ إِلَّا بِمَا شَآءَ ۚ وَسِعَ كُرْسِيُّهُ ٱلسَّمَٰوَٰتِ وَٱلْأَرْضَ ۖ وَلَا يَـُٔودُهُۥ حِفْظُهُمَا ۚ وَهُوَ ٱلْعَلِىُّ ٱلْعَظِيمُ",
    "latin": "Allāhu lā ilāha illā huwa, al-ḥayyul qayyūm. Lā ta'khudhuhu sinatun wa lā nawm, lahu mā fis-samāwāti wa mā fil-arḍ. Man dhālladhī yashfa'u 'indahū illā bi-idhnih. Ya'lamu mā baina aydīhim wa mā khalfahum, wa lā yuḥīṭūna bishay'in min 'ilmihī illā bimā shā'a. Wasi'a kursiyuhus-samāwāti was-samāwāti wal-arḍ, wa lā ya'ūduhū ḥifẓuhumā, wa huwal-'aliyyul-'aẓīm.",
    "translation": "Allah - there is no deity except Him, the Ever-Living, the Sustainer of [all] existence. Neither drowsiness overtakes Him nor sleep. To Him belongs whatever is in the heavens and whatever is on the earth. Who is it that can intercede with Him except by His permission? He knows what is before them and what is behind them, and they encompass not a thing of His knowledge except what He wills. His Kursi extends over the heavens and the earth, and preserving them does not tire Him. And He is the Most High, the Most Great.",
    "notes": "Read 1x",
    "benefits": "Whoever recites Ayat al-Kursi after finishing the prayer, nothing will prevent him from entering Paradise except death.",
    "source": "HR. an-Nasai in Al-Kubro 9: 44. This hadith is declared sahih by Ibn Hibban, as mentioned by Ibn Hajar in Bulughul Maram"
  },
  {
    "title": "Al-Ikhlas",
    "arabic": "قُلْ هُوَ ٱللَّهُ أَحَدٌ (1) ٱللَّهُ ٱلصَّمَدُ (2) لَمْ يَلِدْ وَلَمْ يُولَدْ (3) وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌۢ (4)",
    "latin": "qul huwa Allahu ahad. Allahus-samad. Lam yalid wa lam yulad. Wa lam yakun lahu kufuwan ahad.",
    "translation": "Say, 'He is Allah, [who is] One, (1) Allah, the Eternal Refuge. (2) He neither begets nor is born, (3) Nor is there to Him any equivalent.' (4)",
    "notes": "Read 3x",
    "benefits": "The Messenger of Allah, peace and blessings be upon him, said: Recite Qul huwallahu ahad, and Al-Mu'awwidhatayn (Al-Falaq and An-Nas) in the evening and morning three times, and it will suffice you (protect you) from everything.",
    "source": "HR. Abu Dawud No. 1523 and an-Nasa'i No. 1337. Al Hafizh Abu Thohir said that the chain of this hadith is hasan"
  },
  {
    "title": "Al-Falaq",
    "arabic": "قُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ (1) مِن شَرِّ مَا خَلَقَ (2) وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ (3) وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِى ٱلْعُقَدِ (4) وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ (5)",
    "latin": "qul a'udhu bi rabbil-falaq. min sharri ma khalaq. wa min sharri ghasiqin itha waqab. wa min sharri naffathati fil 'uqad. wa min sharri hasidin itha hasad.",
    "translation": "Say, 'I seek refuge in the Lord of daybreak (1) From the evil of that which He created (2) And from the evil of darkness when it settles (3) And from the evil of the blowers in knots (4) And from the evil of an envier when he envies.' (5)",
    "notes": "Read 3x",
    "benefits": "The Messenger of Allah, peace and blessings be upon him, said: Recite Qul huwallahu ahad, and Al-Mu'awwidhatayn (Al-Falaq and An-Nas) in the evening and morning three times, and it will suffice you (protect you) from everything.",
    "source": "HR. Abu Dawud No. 1523 and an-Nasa'i No. 1337. Al Hafizh Abu Thohir said that the chain of this hadith is hasan"
  },
  {
    "title": "An-Naas",
    "arabic": "قُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ (1) مَلِكِ ٱلنَّاسِ (2) إِلَٰهِ ٱلنَّاسِ (3) مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ (4) ٱلَّذِى يُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ (5) مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ (6)",
    "latin": "qul a'udhu bi rabbin-nas. malikin-nas. ilahin-nas. min sharri al-waswasil khannas. alladhi yuwaswisu fi sudurin-nas. minal jinnati wan-nas.",
    "translation": "Say, 'I seek refuge in the Lord of mankind, (1) The King of mankind, (2) The God of mankind, (3) From the evil of the whisperer who withdraws, (4) Who whispers in the breasts of mankind, (5) Of the jinn and mankind.' (6)",
    "notes": "Read 3x",
    "benefits": "The Messenger of Allah, peace and blessings be upon him, said: Recite Qul huwallahu ahad, and Al-Mu'awwidhatayn (Al-Falaq and An-Nas) in the evening and morning three times, and it will suffice you (protect you) from everything.",
    "source": "HR. Abu Dawud No. 1523 and an-Nasa'i No. 1337. Al Hafizh Abu Thohir said that the chain of this hadith is hasan"
  },
  {
    "title": "Supplication for Beneficial Knowledge, Good Provision, and Accepted Deeds",
    "arabic": "اللَّهُمَّ إِنِّى أَسْأَلُكَ عِلْمًا نَافِعًا وَرِزْقًا طَيِّبًا وَعَمَلاً مُتَقَبَّلاً",
    "latin": "allahumma innii as-aluka 'ilman naafi'a, wa rizqan thayyiba, wa 'amalan mutaqabbala",
    "translation": "O Allah, I ask You for beneficial knowledge, good provision, and accepted deeds.",
    "notes": "Read 1x after the salam of Fajr prayer",
    "benefits": "Beneficial knowledge is a provision that makes life easier, obtaining good provision is a person's goal in working, and accepted deeds are the hope of every person who performs good deeds. Therefore, a servant should always ask for these 3 things every morning before starting their various activities.",
    "source": "HR. Ibn Majah No. 925 and Ahmad 6: 305, 322. Al-Hafizh Abu Thohir said that this hadith is sahih"
  },
  {
    "title": "Send Blessings on the Prophet (Salawāt)",
    "arabic": "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا صَلَّيْتَ عَلَى آلِ إِبْرَاهِيمَ",
    "latin": "allahumma salli 'ala muhammadin wa 'ala ali muhammadin kamaa sallaita 'ala ali ibraheema",
    "translation": "O Allah, send blessings upon Muhammad and the family of Muhammad as You sent blessings upon the family of Ibrahim.",
    "notes": "Read routinely after prayer as part of sending salutations on the Prophet (pbuh).",
    "benefits": "Allah commands the believers to send blessings on the Prophet (QS 33:56). Sending salawāt brings great reward and is recommended often in adhkar.",
    "source": "QS. Al-Ahzab: 56; sound hadith literature encouraging salawāt"
  },
  {
    "title": "SubhanAllahi wa bi-hamdihi (100x benefit hadith)",
    "arabic": "سُبْحَانَ اللَّهِ وَبِحَمْدِهِ",
    "latin": "subhanallahi wa bihamdihi",
    "translation": "Glory be to Allah and praise be to Him.",
    "notes": "Can be recited after salah (or at other times). The Prophet (pbuh) taught the virtue of saying it abundantly.",
    "benefits": "Narrated that whoever says this 100 times a day will have his sins forgiven even if they were like the foam of the sea. It is a highly meritorious dhikr.",
    "source": "HR. al-Bukhari (hadith on the virtue of saying 'SubhanAllah wa bi-hamdihi' 100x)"
  },
  {
    "title": "Astaghfirullah wa atubu ilaih",
    "arabic": "أَسْتَغْفِرُ اللَّهَ وَأَتُوبُ إِلَيْهِ",
    "latin": "astaghfirullah wa atubu ilaih",
    "translation": "I seek Allah's forgiveness and turn to Him in repentance.",
    "notes": "Read freely after prayer; Prophet (pbuh) used to seek forgiveness frequently after completing the prayer.",
    "benefits": "Seeking forgiveness is a core practice immediately after salah; the Prophet (pbuh) sought forgiveness often after prayer.",
    "source": "HR. Muslim and other collections (general practice of seeking forgiveness after prayer)"
  },
  {
    "title": "Complete Tahlil / Long Tahlil (one-time form often used after prayer)",
    "arabic": "لَا إِلَهَ إِلَّا اللَّهُ وَاحِدٌ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ. لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ. لاَ إِلَهَ إِلاَّ اللَّهُ، وَلاَ نَعْبُدُ إِلاَّ إِيَّاهُ. لَهُ النِّعْمَةُ وَلَهُ الْفَضْلُ وَلَهُ الثَّنَاءُ الْحَسَنُ. لَا إِلَهَ إِلَّا اللَّهُ مُخْلِصِينَ لَهُ الدِّيْنَ وَلَوْ كَرِهَ الْكَافِرُونَ",
    "latin": "laa ilaha illallah wahdahu laa sharika lah, lahul mulku wa lahul hamd, wa huwa 'ala kulli shay'in qadeer. laa hawla wa laa quwwata illa billah. laa ilaha illa Allah, wa laa na'budu illa iyyahu. lahu an-ni'matu wa lahu al-fadlu wa lahu ath-thana'ul hasan. laa ilaha illa Allah mukhliseen lahu ad-deena wa law karihal kaafirun.",
    "translation": "There is no deity except Allah, One, with no partner. To Him belongs the dominion and to Him belongs all praise, and He is over all things competent. There is no might nor power except by Allah. There is no deity except Allah; we worship none but Him. To Him belongs the favor and bounty and the beautiful praise. There is no deity except Allah, making the religion sincerely for Him even if the disbelievers dislike it.",
    "notes": "A complete form of tahlil/tasbih often recited after prayer (single recitation).",
    "benefits": "Classical phrasing used in post-salah adhkar; the companions and the early generations used such formulations to glorify and praise Allah.",
    "source": "Hadith compilations (e.g. Muslim) and classical adhkar literature"
  },
  {
    "title": "Ayat al-Kursi (after salah - 1x)",
    "arabic": "ٱللَّهُ لَآ إِلَٰهَ إِلَّا هُوَ ٱلْحَىُّ ٱلْقَيُّومُ ۚ لَا تَأْخُذُهُۥ سِنَةٌ وَلَا نَوْمٌ ۚ لَّهُۥ مَا فِى ٱلسَّمَٰوَٰتِ وَمَا فِى ٱلْأَرْضِ ۗ مَن ذَا ٱلَّذِى يَشْفَعُ عِندَهُۥٓ إِلَّا بِإِذْنِهِۦ ۚ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ ۖ وَلَا يُحِيطُونَ بِشَىْءٍ مِّنْ عِلْمِهِۦٓ إِلَّا بِمَا شَآءَ ۚ وَسِعَ كُرْسِيُّهُ ٱلسَّمَٰوَٰتِ وَٱلْأَرْضَ ۖ وَلَا يَـُٔودُهُۥ حِفْظُهُمَا ۚ وَهُوَ ٱلْعَلِىُّ ٱلْعَظِيمُ",
    "latin": "Allahu la ilaha illa Huwa, Al-Hayyul Qayyum. La ta'khudhuhu sinatun wa la nawm. Lahu ma fis-samawati wa ma fil-ard. Man dhal-ladhi yashfa'u 'indahu illa bi-idhnih. Ya'lamu ma baina aydihim wa ma khalfahum, wa la yuhituna bishay'in min 'ilmihi illa bima sha'a. Wasi'a kursiyuhus-samawati wal-ard, wa la ya'uduhu hifzuhuma, wa Huwa al-'Aliyyu al-'Azim.",
    "translation": "Allah - there is no deity except Him, the Ever-Living, the Sustainer of [all] existence. Neither drowsiness nor sleep overtakes Him. To Him belongs whatever is in the heavens and whatever is on the earth. Who is it that can intercede with Him except by His permission? He knows what is before them and what is behind them, and they do not encompass any of His knowledge except what He wills. His Kursi extends over the heavens and the earth, and preserving them does not tire Him. And He is the Most High, the Most Great.",
    "notes": "Read once after the prayer (many scholars recommend it often for protection).",
    "benefits": "A well-known virtue: reciting Ayat al-Kursi after prayer is a means of protection and great blessing.",
    "source": "QS. Al-Baqarah: 255; hadith literature on recitation and benefits"
  },
  {
    "title": "Recitation of Al-Mu'awwidhatayn (Al-Ikhlâs, Al-Falaq, An-Nâs)",
    "arabic": "قُلْ هُوَ اللَّهُ أَحَدٌ. قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ. قُلْ أَعُوذُ بِرَبِّ النَّاسِ.",
    "latin": "qul huwa Allahu ahad. qul a'udhu bi rabbil-falaq. qul a'udhu bi rabbin-nas.",
    "translation": "Say: He is Allah, [who is] One. Say: I seek refuge in the Lord of daybreak. Say: I seek refuge in the Lord of mankind.",
    "notes": "The Prophet (pbuh) instructed the recitation of the three Quls (Al-Ikhlas and the two Mu'awwidhatayn) after prayers and morning/evening adhkar.",
    "benefits": "These short surahs are powerful for protection; the Prophet (pbuh) recommended their daily recitation for safety.",
    "source": "HR. Abu Dawud and an-Nasa'i (recommendation to recite Mu'awwidhatayn after prayer); Qur'an 112–114"
  },
  {
    "title": "Tasbih (Subhānallāh), Tahmid (Alhamdulillāh), Takbir (Allāhu Akbar) - 33x each",
    "arabic": "سُبْحَانَ اللَّهِ، الْحَمْدُ لِلَّهِ، اللَّهُ أَكْبَرُ",
    "latin": "subhanallah, alhamdulillah, allahu akbar",
    "translation": "Glory be to Allah; All praise is due to Allah; Allah is the Greatest.",
    "notes": "Traditionally recited after each obligatory prayer: SubhanAllah 33x, Alhamdulillah 33x, Allahu Akbar 33x (or variations to reach 100).",
    "benefits": "A widely transmitted post-salah dhikr practice; scholars report many hadiths describing these counts and their virtues (forgiveness, reward and remembrance).",
    "source": "Classical hadith collections and adhkar manuals (various sahih chains reported)"
  }
]
